tap "chipmk/tap"
tap "jandedobbeleer/oh-my-posh"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool for interacting with remote images and registries
brew "crane"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Command-line Golang template processor
brew "gomplate"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Generic machine emulator and virtualizer
brew "qemu"
# Utility that provides fast incremental file transfer
brew "rsync"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Terminal multiplexer
brew "tmux"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Connect directly to Docker-for-Mac containers via IP address 🐳 💻
brew "chipmk/tap/docker-mac-net-connect"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
# Java IDE by JetBrains
cask "intellij-idea"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Open-source code editor
cask "visual-studio-code"
# Connect to Windows
cask "windows-app"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "infeng.vscode-react-typescript"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "wix.vscode-import-cost"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/wailsapp/wails/v3/cmd/wails3"
